#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.conversation_manager_lambda.local_file.placeholder_code: Refreshing state... [id=64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e]
module.okta_provisioner_lambda.local_file.placeholder_code: Refreshing state... [id=64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e]
module.approval_manager_lambda.local_file.placeholder_code: Refreshing state... [id=64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e]
module.event_handler_lambda.local_file.placeholder_code: Refreshing state... [id=64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e]
module.catalog_builder_lambda.local_file.placeholder_code: Refreshing state... [id=64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e]
data.aws_caller_identity.current: Reading...
aws_ssm_parameter.okta_credentials: Refreshing state... [id=/hagrid/okta-credentials]
aws_iam_role.conversation_manager_lambda_role: Refreshing state... [id=hagrid-conversation-manager-role]
module.dynamodb_tables.aws_dynamodb_table.conversations: Refreshing state... [id=hagrid-conversations]
aws_iam_role.approval_manager_lambda_role: Refreshing state... [id=hagrid-approval-manager-role]
aws_iam_role.catalog_builder_lambda_role: Refreshing state... [id=hagrid-catalog-builder-role]
aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-global]
aws_api_gateway_rest_api.hagrid_api: Refreshing state... [id=edt4hjfyae]
aws_ssm_parameter.app_context: Refreshing state... [id=/hagrid/app-context]
module.dynamodb_tables.aws_dynamodb_table.approval_messages: Refreshing state... [id=hagrid-approval-messages]
data.aws_caller_identity.current: Read complete after 0s [id=949134893249]
aws_iam_role.event_handler_lambda_role: Refreshing state... [id=hagrid-event-handler-role]
data.aws_iam_openid_connect_provider.github_actions: Reading...
module.dynamodb_tables.aws_dynamodb_table.access_requests: Refreshing state... [id=hagrid-access-requests]
data.aws_iam_openid_connect_provider.github_actions: Read complete after 0s [id=arn:aws:iam::949134893249:oidc-provider/token.actions.githubusercontent.com]
aws_iam_role.okta_provisioner_lambda_role: Refreshing state... [id=hagrid-okta-provisioner-role]
aws_cloudwatch_log_group.api_gateway_logs: Refreshing state... [id=/aws/apigateway/hagrid-api]
aws_iam_role_policy_attachment.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-global-20260110193053516500000001]
aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
aws_api_gateway_resource.slack: Refreshing state... [id=v5fbrr]
aws_iam_role.github_lambda_deploy: Refreshing state... [id=hagrid-lambda-deploy-role]
aws_iam_role_policy.conversation_manager_ssm: Refreshing state... [id=hagrid-conversation-manager-role:hagrid-conversation-manager-ssm]
aws_iam_role_policy.conversation_manager_cloudwatch: Refreshing state... [id=hagrid-conversation-manager-role:hagrid-conversation-manager-cloudwatch]
aws_iam_role_policy.catalog_builder_lambda_cloudwatch: Refreshing state... [id=hagrid-catalog-builder-role:hagrid-catalog-builder-lambda-cloudwatch]
aws_iam_role_policy.catalog_builder_lambda_ssm: Refreshing state... [id=hagrid-catalog-builder-role:hagrid-catalog-builder-lambda-ssm]
aws_iam_role_policy.approval_manager_cloudwatch: Refreshing state... [id=hagrid-approval-manager-role:hagrid-approval-manager-cloudwatch]
aws_iam_role_policy.approval_manager_lambda_invoke: Refreshing state... [id=hagrid-approval-manager-role:hagrid-approval-manager-lambda-invoke]
aws_iam_role_policy.event_handler_cloudwatch: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-cloudwatch]
aws_iam_role_policy.event_handler_lambda_invoke: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-lambda-invoke]
aws_iam_role_policy.event_handler_ssm: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-ssm]
module.catalog_builder_lambda.aws_lambda_function.function: Refreshing state... [id=hagrid-catalog-builder]
aws_api_gateway_resource.events: Refreshing state... [id=cxjf3c]
aws_iam_role_policy.okta_provisioner_ssm: Refreshing state... [id=hagrid-okta-provisioner-role:hagrid-okta-provisioner-ssm]
aws_iam_role_policy.okta_provisioner_cloudwatch: Refreshing state... [id=hagrid-okta-provisioner-role:hagrid-okta-provisioner-cloudwatch]
module.okta_provisioner_lambda.aws_lambda_function.function: Refreshing state... [id=hagrid-okta-provisioner]
aws_iam_role_policy.github_lambda_deploy: Refreshing state... [id=hagrid-lambda-deploy-role:hagrid-lambda-deploy-policy]
aws_iam_role_policy.approval_manager_dynamodb: Refreshing state... [id=hagrid-approval-manager-role:hagrid-approval-manager-dynamodb]
aws_iam_role_policy.conversation_manager_dynamodb: Refreshing state... [id=hagrid-conversation-manager-role:hagrid-conversation-manager-dynamodb]
aws_iam_role_policy.event_handler_dynamodb: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-dynamodb]
module.approval_manager_lambda.aws_lambda_function.function: Refreshing state... [id=hagrid-approval-manager]
module.event_handler_lambda.aws_lambda_function.function: Refreshing state... [id=hagrid-event-handler]
module.conversation_manager_lambda.aws_lambda_function.function: Refreshing state... [id=hagrid-conversation-manager]
aws_api_gateway_method.post_events: Refreshing state... [id=agm-edt4hjfyae-cxjf3c-POST]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-edt4hjfyae-cxjf3c-POST]
aws_api_gateway_deployment.prod: Refreshing state... [id=k8nb8g]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-edt4hjfyae-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.approval_manager_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT -> null
        id                   = "64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e"
        # (9 unchanged attributes hidden)
    }

  # module.catalog_builder_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT -> null
        id                   = "64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e"
        # (9 unchanged attributes hidden)
    }

  # module.conversation_manager_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT -> null
        id                   = "64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e"
        # (9 unchanged attributes hidden)
    }

  # module.event_handler_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT -> null
        id                   = "64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e"
        # (9 unchanged attributes hidden)
    }

  # module.okta_provisioner_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT -> null
        id                   = "64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ssm_parameter.slack_signing_secret will be created
  + resource "aws_ssm_parameter" "slack_signing_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Slack signing secret for webhook request verification"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/hagrid/slack-signing-secret"
      + tags           = {
          + "Name"    = "hagrid-slack-signing-secret"
          + "Project" = "hagrid"
        }
      + tags_all       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-slack-signing-secret"
          + "Project"   = "hagrid"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.approval_manager_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-approval-manager.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.approval_manager_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-approval-manager/index.py"
      + id                   = (known after apply)
    }

  # module.catalog_builder_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-catalog-builder.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.catalog_builder_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-catalog-builder/index.py"
      + id                   = (known after apply)
    }

  # module.conversation_manager_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-conversation-manager.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.conversation_manager_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-conversation-manager/index.py"
      + id                   = (known after apply)
    }

  # module.event_handler_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-event-handler.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.event_handler_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-event-handler/index.py"
      + id                   = (known after apply)
    }

  # module.okta_provisioner_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-okta-provisioner.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.okta_provisioner_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-okta-provisioner/index.py"
      + id                   = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @m0liere, Action: `pull_request`*